#### list compression quicky

In [1]:
x = [1,2,3,4,5]

In [2]:
x10 = []
for i in x:
    x10.append(i+10)
x10

[11, 12, 13, 14, 15]

In [3]:
x20 = [i+20 for i in x] # list comprehension

Lambda expression

In [4]:
xpow2 = list(map(lambda i: i**2, x))
xpow2

[1, 4, 9, 16, 25]

In [5]:
import pandas as pd

In [9]:
df = pd.read_clipboard(sep=',')

In [11]:
df

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1

In [13]:
df['cyl'] = df.cyl.apply(lambda a: a*10)

In [14]:
df

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,60,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,60,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,40,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,60,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,80,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,60,225.0,105,2.76,3.460,20.22,1,0,3,1